# specify a directory to install: https://github.com/Homebrew/homebrew-bundle
cask_args appdir: '/Applications'

# install packages
brew 'git'
brew 'git-lfs'
brew 'zsh'
brew 'wget'
brew 'curl'
brew 'docker'
brew 'docker-compose'
brew 'zip'
brew 'vcpkg'
brew 'vim'
brew 'tmux'

# go
brew 'go'

# python
brew 'python'

# cmake
brew 'cmake'

# node
brew 'node'

# SystemVerilog
brew 'verilator'

# utilities
brew 'ffmpeg' # media handling
brew 'tldr'   # man alternative
